MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH124/mcu.h
extern volatile __C2FIFOCI5bits_t C2FIFOCI5bits __asm__ ("C2FIFOCI5") __attribute__((section("sfrs"), address(0xBF8814C0)));
extern volatile uint32_t        C2FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF8814C4)));
extern volatile uint32_t        C2FIFOCI5SET __attribute__((section("sfrs"),address(0xBF8814C8)));
extern volatile uint32_t        C2FIFOCI5INV __attribute__((section("sfrs"),address(0xBF8814CC)));
#define C2FIFOCON6 C2FIFOCON6
extern volatile uint32_t   C2FIFOCON6 __attribute__((section("sfrs"), address(0xBF8814D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON6bits_t;
extern volatile __C2FIFOCON6bits_t C2FIFOCON6bits __asm__ ("C2FIFOCON6") __attribute__((section("sfrs"), address(0xBF8814D0)));
extern volatile uint32_t        C2FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF8814D4)));
extern volatile uint32_t        C2FIFOCON6SET __attribute__((section("sfrs"),address(0xBF8814D8)));
extern volatile uint32_t        C2FIFOCON6INV __attribute__((section("sfrs"),address(0xBF8814DC)));
#define C2FIFOINT6 C2FIFOINT6
extern volatile uint32_t   C2FIFOINT6 __attribute__((section("sfrs"), address(0xBF8814E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT6bits_t;
extern volatile __C2FIFOINT6bits_t C2FIFOINT6bits __asm__ ("C2FIFOINT6") __attribute__((section("sfrs"), address(0xBF8814E0)));
extern volatile uint32_t        C2FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF8814E4)));
extern volatile uint32_t        C2FIFOINT6SET __attribute__((section("sfrs"),address(0xBF8814E8)));
extern volatile uint32_t        C2FIFOINT6INV __attribute__((section("sfrs"),address(0xBF8814EC)));
#define C2FIFOUA6 C2FIFOUA6
extern volatile uint32_t   C2FIFOUA6 __attribute__((section("sfrs"), address(0xBF8814F0)));
extern volatile uint32_t        C2FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF8814F4)));
extern volatile uint32_t        C2FIFOUA6SET __attribute__((section("sfrs"),address(0xBF8814F8)));
extern volatile uint32_t        C2FIFOUA6INV __attribute__((section("sfrs"),address(0xBF8814FC)));
#define C2FIFOCI6 C2FIFOCI6
extern volatile uint32_t   C2FIFOCI6 __attribute__((section("sfrs"), address(0xBF881500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI6bits_t;
extern volatile __C2FIFOCI6bits_t C2FIFOCI6bits __asm__ ("C2FIFOCI6") __attribute__((section("sfrs"), address(0xBF881500)));
extern volatile uint32_t        C2FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF881504)));
extern volatile uint32_t        C2FIFOCI6SET __attribute__((section("sfrs"),address(0xBF881508)));
extern volatile uint32_t        C2FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88150C)));
#define C2FIFOCON7 C2FIFOCON7
extern volatile uint32_t   C2FIFOCON7 __attribute__((section("sfrs"), address(0xBF881510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON7bits_t;
extern volatile __C2FIFOCON7bits_t C2FIFOCON7bits __asm__ ("C2FIFOCON7") __attribute__((section("sfrs"), address(0xBF881510)));
extern volatile uint32_t        C2FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF881514)));
extern volatile uint32_t        C2FIFOCON7SET __attribute__((section("sfrs"),address(0xBF881518)));
extern volatile uint32_t        C2FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88151C)));
#define C2FIFOINT7 C2FIFOINT7
extern volatile uint32_t   C2FIFOINT7 __attribute__((section("sfrs"), address(0xBF881520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT7bits_t;
extern volatile __C2FIFOINT7bits_t C2FIFOINT7bits __asm__ ("C2FIFOINT7") __attribute__((section("sfrs"), address(0xBF881520)));
extern volatile uint32_t        C2FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF881524)));
extern volatile uint32_t        C2FIFOINT7SET __attribute__((section("sfrs"),address(0xBF881528)));
extern volatile uint32_t        C2FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88152C)));
#define C2FIFOUA7 C2FIFOUA7
extern volatile uint32_t   C2FIFOUA7 __attribute__((section("sfrs"), address(0xBF881530)));
extern volatile uint32_t        C2FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF881534)));
extern volatile uint32_t        C2FIFOUA7SET __attribute__((section("sfrs"),address(0xBF881538)));
extern volatile uint32_t        C2FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88153C)));
#define C2FIFOCI7 C2FIFOCI7
extern volatile uint32_t   C2FIFOCI7 __attribute__((section("sfrs"), address(0xBF881540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI7bits_t;
extern volatile __C2FIFOCI7bits_t C2FIFOCI7bits __asm__ ("C2FIFOCI7") __attribute__((section("sfrs"), address(0xBF881540)));
extern volatile uint32_t        C2FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF881544)));
extern volatile uint32_t        C2FIFOCI7SET __attribute__((section("sfrs"),address(0xBF881548)));
extern volatile uint32_t        C2FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88154C)));
#define C2FIFOCON8 C2FIFOCON8
extern volatile uint32_t   C2FIFOCON8 __attribute__((section("sfrs"), address(0xBF881550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON8bits_t;
extern volatile __C2FIFOCON8bits_t C2FIFOCON8bits __asm__ ("C2FIFOCON8") __attribute__((section("sfrs"), address(0xBF881550)));
extern volatile uint32_t        C2FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF881554)));
extern volatile uint32_t        C2FIFOCON8SET __attribute__((section("sfrs"),address(0xBF881558)));
extern volatile uint32_t        C2FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88155C)));
#define C2FIFOINT8 C2FIFOINT8
extern volatile uint32_t   C2FIFOINT8 __attribute__((section("sfrs"), address(0xBF881560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT8bits_t;
extern volatile __C2FIFOINT8bits_t C2FIFOINT8bits __asm__ ("C2FIFOINT8") __attribute__((section("sfrs"), address(0xBF881560)));
extern volatile uint32_t        C2FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF881564)));
extern volatile uint32_t        C2FIFOINT8SET __attribute__((section("sfrs"),address(0xBF881568)));
extern volatile uint32_t        C2FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88156C)));
#define C2FIFOUA8 C2FIFOUA8
extern volatile uint32_t   C2FIFOUA8 __attribute__((section("sfrs"), address(0xBF881570)));
extern volatile uint32_t        C2FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF881574)));
extern volatile uint32_t        C2FIFOUA8SET __attribute__((section("sfrs"),address(0xBF881578)));
extern volatile uint32_t        C2FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88157C)));
#define C2FIFOCI8 C2FIFOCI8
extern volatile uint32_t   C2FIFOCI8 __attribute__((section("sfrs"), address(0xBF881580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI8bits_t;
extern volatile __C2FIFOCI8bits_t C2FIFOCI8bits __asm__ ("C2FIFOCI8") __attribute__((section("sfrs"), address(0xBF881580)));
extern volatile uint32_t        C2FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF881584)));
extern volatile uint32_t        C2FIFOCI8SET __attribute__((section("sfrs"),address(0xBF881588)));
extern volatile uint32_t        C2FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88158C)));
#define C2FIFOCON9 C2FIFOCON9
extern volatile uint32_t   C2FIFOCON9 __attribute__((section("sfrs"), address(0xBF881590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON9bits_t;
extern volatile __C2FIFOCON9bits_t C2FIFOCON9bits __asm__ ("C2FIFOCON9") __attribute__((section("sfrs"), address(0xBF881590)));
extern volatile uint32_t        C2FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF881594)));
extern volatile uint32_t        C2FIFOCON9SET __attribute__((section("sfrs"),address(0xBF881598)));
extern volatile uint32_t        C2FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88159C)));
#define C2FIFOINT9 C2FIFOINT9
extern volatile uint32_t   C2FIFOINT9 __attribute__((section("sfrs"), address(0xBF8815A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT9bits_t;
extern volatile __C2FIFOINT9bits_t C2FIFOINT9bits __asm__ ("C2FIFOINT9") __attribute__((section("sfrs"), address(0xBF8815A0)));
extern volatile uint32_t        C2FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF8815A4)));
extern volatile uint32_t        C2FIFOINT9SET __attribute__((section("sfrs"),address(0xBF8815A8)));
extern volatile uint32_t        C2FIFOINT9INV __attribute__((section("sfrs"),address(0xBF8815AC)));
#define C2FIFOUA9 C2FIFOUA9
extern volatile uint32_t   C2FIFOUA9 __attribute__((section("sfrs"), address(0xBF8815B0)));
extern volatile uint32_t        C2FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF8815B4)));
extern volatile uint32_t        C2FIFOUA9SET __attribute__((section("sfrs"),address(0xBF8815B8)));
extern volatile uint32_t        C2FIFOUA9INV __attribute__((section("sfrs"),address(0xBF8815BC)));
#define C2FIFOCI9 C2FIFOCI9
extern volatile uint32_t   C2FIFOCI9 __attribute__((section("sfrs"), address(0xBF8815C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI9bits_t;
extern volatile __C2FIFOCI9bits_t C2FIFOCI9bits __asm__ ("C2FIFOCI9") __attribute__((section("sfrs"), address(0xBF8815C0)));
extern volatile uint32_t        C2FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF8815C4)));
extern volatile uint32_t        C2FIFOCI9SET __attribute__((section("sfrs"),address(0xBF8815C8)));
extern volatile uint32_t        C2FIFOCI9INV __attribute__((section("sfrs"),address(0xBF8815CC)));
#define C2FIFOCON10 C2FIFOCON10
extern volatile uint32_t   C2FIFOCON10 __attribute__((section("sfrs"), address(0xBF8815D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON10bits_t;
extern volatile __C2FIFOCON10bits_t C2FIFOCON10bits __asm__ ("C2FIFOCON10") __attribute__((section("sfrs"), address(0xBF8815D0)));
extern volatile uint32_t        C2FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF8815D4)));
extern volatile uint32_t        C2FIFOCON10SET __attribute__((section("sfrs"),address(0xBF8815D8)));
extern volatile uint32_t        C2FIFOCON10INV __attribute__((section("sfrs"),address(0xBF8815DC)));
#define C2FIFOINT10 C2FIFOINT10
extern volatile uint32_t   C2FIFOINT10 __attribute__((section("sfrs"), address(0xBF8815E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT10bits_t;
extern volatile __C2FIFOINT10bits_t C2FIFOINT10bits __asm__ ("C2FIFOINT10") __attribute__((section("sfrs"), address(0xBF8815E0)));
extern volatile uint32_t        C2FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF8815E4)));
extern volatile uint32_t        C2FIFOINT10SET __attribute__((section("sfrs"),address(0xBF8815E8)));
extern volatile uint32_t        C2FIFOINT10INV __attribute__((section("sfrs"),address(0xBF8815EC)));
#define C2FIFOUA10 C2FIFOUA10
extern volatile uint32_t   C2FIFOUA10 __attribute__((section("sfrs"), address(0xBF8815F0)));
extern volatile uint32_t        C2FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF8815F4)));
extern volatile uint32_t        C2FIFOUA10SET __attribute__((section("sfrs"),address(0xBF8815F8)));
extern volatile uint32_t        C2FIFOUA10INV __attribute__((section("sfrs"),address(0xBF8815FC)));
#define C2FIFOCI10 C2FIFOCI10
extern volatile uint32_t   C2FIFOCI10 __attribute__((section("sfrs"), address(0xBF881600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI10bits_t;
extern volatile __C2FIFOCI10bits_t C2FIFOCI10bits __asm__ ("C2FIFOCI10") __attribute__((section("sfrs"), address(0xBF881600)));
extern volatile uint32_t        C2FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF881604)));
extern volatile uint32_t        C2FIFOCI10SET __attribute__((section("sfrs"),address(0xBF881608)));
extern volatile uint32_t        C2FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88160C)));
#define C2FIFOCON11 C2FIFOCON11
extern volatile uint32_t   C2FIFOCON11 __attribute__((section("sfrs"), address(0xBF881610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON11bits_t;
