MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH124/mcu.h
#define _CNNEE_CNNEE3_POSITION                   0x00000003
#define _CNNEE_CNNEE3_MASK                       0x00000008
#define _CNNEE_CNNEE3_LENGTH                     0x00000001

#define _CNNEE_CNNEE4_POSITION                   0x00000004
#define _CNNEE_CNNEE4_MASK                       0x00000010
#define _CNNEE_CNNEE4_LENGTH                     0x00000001

#define _CNNEE_CNNEE5_POSITION                   0x00000005
#define _CNNEE_CNNEE5_MASK                       0x00000020
#define _CNNEE_CNNEE5_LENGTH                     0x00000001

#define _CNNEE_CNNEE6_POSITION                   0x00000006
#define _CNNEE_CNNEE6_MASK                       0x00000040
#define _CNNEE_CNNEE6_LENGTH                     0x00000001

#define _CNNEE_CNNEE7_POSITION                   0x00000007
#define _CNNEE_CNNEE7_MASK                       0x00000080
#define _CNNEE_CNNEE7_LENGTH                     0x00000001

#define _CNNEE_CNNEE8_POSITION                   0x00000008
#define _CNNEE_CNNEE8_MASK                       0x00000100
#define _CNNEE_CNNEE8_LENGTH                     0x00000001

#define _CNNEE_CNNEE9_POSITION                   0x00000009
#define _CNNEE_CNNEE9_MASK                       0x00000200
#define _CNNEE_CNNEE9_LENGTH                     0x00000001

#define _CNFE_CNFE0_POSITION                     0x00000000
#define _CNFE_CNFE0_MASK                         0x00000001
#define _CNFE_CNFE0_LENGTH                       0x00000001

#define _CNFE_CNFE1_POSITION                     0x00000001
#define _CNFE_CNFE1_MASK                         0x00000002
#define _CNFE_CNFE1_LENGTH                       0x00000001

#define _CNFE_CNFE2_POSITION                     0x00000002
#define _CNFE_CNFE2_MASK                         0x00000004
#define _CNFE_CNFE2_LENGTH                       0x00000001

#define _CNFE_CNFE3_POSITION                     0x00000003
#define _CNFE_CNFE3_MASK                         0x00000008
#define _CNFE_CNFE3_LENGTH                       0x00000001

#define _CNFE_CNFE4_POSITION                     0x00000004
#define _CNFE_CNFE4_MASK                         0x00000010
#define _CNFE_CNFE4_LENGTH                       0x00000001

#define _CNFE_CNFE5_POSITION                     0x00000005
#define _CNFE_CNFE5_MASK                         0x00000020
#define _CNFE_CNFE5_LENGTH                       0x00000001

#define _CNFE_CNFE6_POSITION                     0x00000006
#define _CNFE_CNFE6_MASK                         0x00000040
#define _CNFE_CNFE6_LENGTH                       0x00000001

#define _CNFE_CNFE7_POSITION                     0x00000007
#define _CNFE_CNFE7_MASK                         0x00000080
#define _CNFE_CNFE7_LENGTH                       0x00000001

#define _CNFE_CNFE8_POSITION                     0x00000008
#define _CNFE_CNFE8_MASK                         0x00000100
#define _CNFE_CNFE8_LENGTH                       0x00000001

#define _CNFE_CNFE9_POSITION                     0x00000009
#define _CNFE_CNFE9_MASK                         0x00000200
#define _CNFE_CNFE9_LENGTH                       0x00000001

#define _SRCON0E_SR0E0_POSITION                  0x00000000
#define _SRCON0E_SR0E0_MASK                      0x00000001
#define _SRCON0E_SR0E0_LENGTH                    0x00000001

#define _SRCON0E_SR0E1_POSITION                  0x00000001
#define _SRCON0E_SR0E1_MASK                      0x00000002
#define _SRCON0E_SR0E1_LENGTH                    0x00000001

#define _SRCON0E_SR0E2_POSITION                  0x00000002
#define _SRCON0E_SR0E2_MASK                      0x00000004
#define _SRCON0E_SR0E2_LENGTH                    0x00000001

#define _SRCON0E_SR0E3_POSITION                  0x00000003
#define _SRCON0E_SR0E3_MASK                      0x00000008
#define _SRCON0E_SR0E3_LENGTH                    0x00000001

#define _SRCON1E_SR1E0_POSITION                  0x00000000
#define _SRCON1E_SR1E0_MASK                      0x00000001
#define _SRCON1E_SR1E0_LENGTH                    0x00000001

#define _SRCON1E_SR1E1_POSITION                  0x00000001
#define _SRCON1E_SR1E1_MASK                      0x00000002
#define _SRCON1E_SR1E1_LENGTH                    0x00000001

#define _SRCON1E_SR1E2_POSITION                  0x00000002
#define _SRCON1E_SR1E2_MASK                      0x00000004
#define _SRCON1E_SR1E2_LENGTH                    0x00000001

#define _SRCON1E_SR1E3_POSITION                  0x00000003
#define _SRCON1E_SR1E3_MASK                      0x00000008
#define _SRCON1E_SR1E3_LENGTH                    0x00000001

#define _ANSELF_ANSF12_POSITION                  0x0000000C
#define _ANSELF_ANSF12_MASK                      0x00001000
#define _ANSELF_ANSF12_LENGTH                    0x00000001

#define _ANSELF_ANSF13_POSITION                  0x0000000D
#define _ANSELF_ANSF13_MASK                      0x00002000
#define _ANSELF_ANSF13_LENGTH                    0x00000001

#define _ANSELF_w_POSITION                       0x00000000
#define _ANSELF_w_MASK                           0xFFFFFFFF
#define _ANSELF_w_LENGTH                         0x00000020

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

#define _TRISF_TRISF2_POSITION                   0x00000002
#define _TRISF_TRISF2_MASK                       0x00000004
#define _TRISF_TRISF2_LENGTH                     0x00000001

#define _TRISF_TRISF3_POSITION                   0x00000003
#define _TRISF_TRISF3_MASK                       0x00000008
#define _TRISF_TRISF3_LENGTH                     0x00000001

#define _TRISF_TRISF4_POSITION                   0x00000004
#define _TRISF_TRISF4_MASK                       0x00000010
#define _TRISF_TRISF4_LENGTH                     0x00000001

#define _TRISF_TRISF5_POSITION                   0x00000005
#define _TRISF_TRISF5_MASK                       0x00000020
#define _TRISF_TRISF5_LENGTH                     0x00000001

#define _TRISF_TRISF8_POSITION                   0x00000008
#define _TRISF_TRISF8_MASK                       0x00000100
#define _TRISF_TRISF8_LENGTH                     0x00000001

#define _TRISF_TRISF12_POSITION                  0x0000000C
#define _TRISF_TRISF12_MASK                      0x00001000
#define _TRISF_TRISF12_LENGTH                    0x00000001

#define _TRISF_TRISF13_POSITION                  0x0000000D
#define _TRISF_TRISF13_MASK                      0x00002000
#define _TRISF_TRISF13_LENGTH                    0x00000001

